{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activation": "linear", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "dtype": "float32", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 100, 100, 3], "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "trainable": true, "epsilon": 0.001, "center": true, "beta_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"strides": [3, 3], "padding": "valid", "trainable": true, "pool_size": [3, 3], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_1", "rate": 0.5, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "activation": "linear", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "trainable": true, "epsilon": 0.001, "center": true, "beta_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "activation": "linear", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "trainable": true, "epsilon": 0.001, "center": true, "beta_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_2", "rate": 0.25, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "activation": "linear", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "trainable": true, "epsilon": 0.001, "center": true, "beta_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "activation": "linear", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "trainable": true, "epsilon": 0.001, "center": true, "beta_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_3", "rate": 0.25, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 1024, "activation": "linear", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "trainable": true, "epsilon": 0.001, "center": true, "beta_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"seed": null, "name": "dropout_4", "rate": 0.5, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 60, "activation": "linear", "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.0"}