{"config": [{"config": {"bias_constraint": null, "padding": "same", "trainable": true, "dtype": "float32", "kernel_constraint": null, "batch_input_shape": [null, 100, 100, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_1", "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_1", "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "pool_size": [3, 3], "trainable": true, "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_2", "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_2", "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_3", "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_3", "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_4", "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_4", "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_5", "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_5", "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "units": 1024, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "name": "batch_normalization_6", "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "units": 60, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_7"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.0"}